# Groupby

In this lecture, we will learn how to use the groupby() method which allows us to group a bunch of rows together and call aggregate functions on them.

In [12]:
import numpy as np
import pandas as pd

In [13]:
# create a dictionary in Python 
data = {
    'Company' : ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
    'Person'  : ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
    'Sales'   : [200, 120, 340, 124, 243, 350]
}

In [21]:
# convert the python dictionary into a pandas dataFrame
df = pd.DataFrame(data=data)

df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

Now, we can use the groupby() method to group rows together based of a column name.

In [17]:
# let us group the rows togther by the company column
byCompany = df.groupby(by='Company')

In [18]:
byCompany

Just by grouping together a bunch of rows based off a column name, we get a pandas groupby object.

The second step after having created a pandas groupby object is to call an aggregate function on it.

In [22]:
# If we wanted to get the mean grouped by the company name, pandas will automatically only 
# target the columns containing numerical data
byCompany.mean()

# Since pandas rules out the contention of any non-numerical column for aggregate functions like mean, sum, median etc. 
# therefore we can only see the "Sales" column below and not the "Person" column

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [23]:
# Similarly, we can get the sum of the sales of each company
byCompany.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

#### More examples of aggreagate methods

In [25]:
# Similarly, we can get the standard deviation of the sales of each company
byCompany.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [26]:
# Notice how the aggregate function min() acts on String based columns as well.
byCompany.min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [27]:
# get the max sales of each company
byCompany.max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [28]:
# get the count of the sales of each company
byCompany.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

Notice that on invoking an aggregate function on the groupby object, we get back an actual data frame with an index called Company and the column value of sales and/or Person. This means that we can use all the built-in dataFrame methods on the result.

In [30]:
byCompany.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [31]:
# Instead of calling the aggregate functions on a saved instance of the groupby object, we can simply combine all operations
df.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

#### Using groupby with describe()

We can use the groupby object with the describle method to get a bunch of important information all in one go.

In [32]:
df.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

If we don't like the format in which the describe() displays the information to us, we can transpose it.

In [33]:
df.groupby('Company').describe().transpose()

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

After this we can simply use the bracket notation to limit the information to certain columns.

In [34]:
df.groupby('Company').describe().transpose()['FB']

Sales  count      2.000000
       mean     296.500000
       std       75.660426
       min      243.000000
       25%      269.750000
       50%      296.500000
       75%      323.250000
       max      350.000000
Name: FB, dtype: float64